### 4 dimension for EDA
- 1. Composition
- 2. Distribution
- 3. comparison
- 4. Relationship

In [1]:
# import library
import pandas as pd

In [7]:
# load the dataset
df = pd.read_excel("../dataset/titanc.xlsx")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### composition

In [12]:
df.shape
# print the number of rows and columns using f string
print(f"No. of Rows: {df.shape[0]}\nNo. of Columns: {df.shape[1]}")

No. of Rows: 891
No. of Columns: 15

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [15]:
df.dtypes
# print only the boolean columns
print(f"Boolean Columns: {df.select_dtypes(include='bool').columns.tolist()}")

Boolean Columns: ['adult_male', 'alone']

In [17]:
df.head()
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [18]:
# total numbers of row
len(df)

891

In [21]:
# find value counts percentage for sex column
# df["sex"].value_counts(normalize=True) * 100
df["sex"].value_counts()/ len(df) * 100
# round  the percentage to 2 decimal places
round(df['sex'].value_counts()/ len(df) * 100, 2)

sex
male      64.76
female    35.24
Name: count, dtype: float64

In [ ]:
# 19